# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'mas' # Mac App Store manager
brew 'neofetch'
brew 'teamookla/speedtest/speedtest'
brew 'youtube-dl'
brew 'zlib'

# Shell
brew 'zsh-autosuggestions'
brew 'tmux'

# Development
brew 'mysql'
brew 'node'
brew 'python'
brew 'vim'

# Apps
cask 'atom'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

# Fonts
cask 'font-meslolg-nerd-font'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
