# Taps
tap 'homebrew/cask-fonts'
tap 'romkatv/powerlevel10k'
tap 'teamookla/speedtest'

# Binaries
brew 'bat' # Better 'cat' replacement
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa' # Better 'ls' replacement
brew 'fd' # Faster 'find' replacement
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'golang'
brew 'lazygit'
brew 'mas'
brew 'mosh'
brew 'neofetch'
brew 'neovim'
brew 'newsboat'
brew 'node'
brew 'powerlevel10k'
brew 'python'
brew 'ripgrep' # Faster 'grep' replacement
brew 'silicon' # Code screenshot tool
brew 'speedtest'
brew 'tmux'
brew 'yt-dlp'
brew 'zlib'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps
cask '1password'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iina'
cask 'neovide'
cask 'playdate-simulator'
cask 'transmission'
cask 'visual-studio-code'
cask 'wezterm'

# Mac App Store
mas '1Password for Safari', id: 1569813296
mas 'AdGuard for Safari', id: 1440147258
mas 'Dark Reader for Safari', id: 1438243180
mas 'Tailscale', id: 1475387142
mas 'Vimari', id: 1480933944

# Fonts
cask 'font-fira-code-nerd-font'
